# Read the RTL description as a verilog file
read_verilog boothMultiplierRTL.v 

# Hierarchy and checks
hierarchy -check -top boothMultiplier

# Flatten the design if needed 
flatten 

# write the RTL level netlist 
write_verilog -noattr RTL_netlist.v 

show -format svg -prefix simple_module_rtl_schematic

